In [11]:
import pandas as pd

In [12]:
## this notebook is all about trimming down the dataset to remove any data that wont be usefull

df = pd.read_csv('../../data/valley_fever_rates/valley_fever_rates_05_30_24.csv')
print(df.shape)
df.head()

(1408, 4)

    County  Year  Cases  Rate
0  ALAMEDA  2001      7   0.5
1  ALAMEDA  2002      2   0.1
2  ALAMEDA  2003      9   0.7
3  ALAMEDA  2004     12   0.9
4  ALAMEDA  2005     11   0.8

In [13]:
print(df['County'].unique())

['ALAMEDA' 'ALAMEDA COUNTY TOTAL' 'ALPINE' 'AMADOR' 'BERKELEY' 'BUTTE'
 'CALAVERAS' 'CALIFORNIA TOTAL' 'COLUSA' 'CONTRA COSTA' 'DEL NORTE'
 'EL DORADO' 'FRESNO' 'GLENN' 'HUMBOLDT' 'IMPERIAL' 'INYO' 'KERN' 'KINGS'
 'LAKE' 'LASSEN' 'LONG BEACH' 'LOS ANGELES' 'LOS ANGELES COUNTY TOTAL'
 'MADERA' 'MARIN' 'MARIPOSA' 'MENDOCINO' 'MERCED' 'MODOC' 'MONO'
 'MONTEREY' 'NAPA' 'NEVADA' 'ORANGE' 'PASADENA' 'PLACER' 'PLUMAS'
 'RIVERSIDE' 'SACRAMENTO' 'SAN BENITO' 'SAN BERNARDINO' 'SAN DIEGO'
 'SAN FRANCISCO' 'SAN JOAQUIN' 'SAN LUIS OBISPO' 'SAN MATEO'
 'SANTA BARBARA' 'SANTA CLARA' 'SANTA CRUZ' 'SHASTA' 'SIERRA' 'SISKIYOU'
 'SOLANO' 'SONOMA' 'STANISLAUS' 'SUTTER' 'TEHAMA' 'TRINITY' 'TULARE'
 'TUOLUMNE' 'VENTURA' 'YOLO' 'YUBA']

In [14]:
# remove county totals for they are essentially duplicates and hard to get meteorological data for them
counties_to_drop = ['ALAMEDA COUNTY TOTAL', 'CALIFORNIA TOTAL', 'LOS ANGELES COUNTY TOTAL']
df = df.drop(df[df['County'].isin(counties_to_drop)].index, axis=0)
print(df.shape)
print(df['County'].unique())
df.head()

(1342, 4)
['ALAMEDA' 'ALPINE' 'AMADOR' 'BERKELEY' 'BUTTE' 'CALAVERAS' 'COLUSA'
 'CONTRA COSTA' 'DEL NORTE' 'EL DORADO' 'FRESNO' 'GLENN' 'HUMBOLDT'
 'IMPERIAL' 'INYO' 'KERN' 'KINGS' 'LAKE' 'LASSEN' 'LONG BEACH'
 'LOS ANGELES' 'MADERA' 'MARIN' 'MARIPOSA' 'MENDOCINO' 'MERCED' 'MODOC'
 'MONO' 'MONTEREY' 'NAPA' 'NEVADA' 'ORANGE' 'PASADENA' 'PLACER' 'PLUMAS'
 'RIVERSIDE' 'SACRAMENTO' 'SAN BENITO' 'SAN BERNARDINO' 'SAN DIEGO'
 'SAN FRANCISCO' 'SAN JOAQUIN' 'SAN LUIS OBISPO' 'SAN MATEO'
 'SANTA BARBARA' 'SANTA CLARA' 'SANTA CRUZ' 'SHASTA' 'SIERRA' 'SISKIYOU'
 'SOLANO' 'SONOMA' 'STANISLAUS' 'SUTTER' 'TEHAMA' 'TRINITY' 'TULARE'
 'TUOLUMNE' 'VENTURA' 'YOLO' 'YUBA']

    County  Year  Cases  Rate
0  ALAMEDA  2001      7   0.5
1  ALAMEDA  2002      2   0.1
2  ALAMEDA  2003      9   0.7
3  ALAMEDA  2004     12   0.9
4  ALAMEDA  2005     11   0.8

In [15]:
print(df.isnull().sum())

County      0
Year        0
Cases       0
Rate      396
dtype: int64

In [16]:
#since rate is so sparse we are goint to drop that feature since we are just looking for case numbers  as our target

df = df.drop('Rate', axis=1)
print(df.shape)
df.head()

(1342, 3)

    County  Year  Cases
0  ALAMEDA  2001      7
1  ALAMEDA  2002      2
2  ALAMEDA  2003      9
3  ALAMEDA  2004     12
4  ALAMEDA  2005     11

In [31]:
print(f'The range of values in the cases are from {df["Cases"].min()} to {df["Cases"].max()}')
count_zero_cases = (df['Cases'] == 0).sum()
print(f"Number of occurrences where 'Cases' == 0: {count_zero_cases}")

zero_cases = df[df['Cases'] == 0]
print(f'\nThe places where there are no cases includes:\n{zero_cases["County"].unique()}\n')
print(f'The count of counties where there are zero cases: {len(zero_cases["County"].unique())}')

The range of values in the cases are from 0 to 3385
Number of occurrences where 'Cases' == 0: 396

The places where there are no cases includes:
['ALPINE' 'AMADOR' 'BERKELEY' 'BUTTE' 'CALAVERAS' 'COLUSA' 'DEL NORTE'
 'EL DORADO' 'GLENN' 'HUMBOLDT' 'IMPERIAL' 'INYO' 'LAKE' 'LASSEN' 'MARIN'
 'MARIPOSA' 'MENDOCINO' 'MODOC' 'MONO' 'NAPA' 'NEVADA' 'PASADENA' 'PLACER'
 'PLUMAS' 'SAN BENITO' 'SAN FRANCISCO' 'SAN MATEO' 'SANTA CRUZ' 'SHASTA'
 'SIERRA' 'SISKIYOU' 'SOLANO' 'SONOMA' 'SUTTER' 'TEHAMA' 'TRINITY'
 'TUOLUMNE' 'YOLO' 'YUBA']

The count of counties where there are zero cases: 39